package swu.xl.imarten.Constant;

import swu.xl.imarten.R;

public interface TennisConstant {
    int[] avatar_ids = {
            R.drawable.tennis_1,
            R.drawable.tennis_2,
            R.drawable.tennis_3,
            R.drawable.tennis_4
    };

    int[] poster_ids = {
            R.drawable.tennis_poster_1,
            R.drawable.tennis_poster_2,
            R.drawable.tennis_poster_3,
            R.drawable.tennis_poster_4
    };

    String[] e_names = {
          "Andy Murray",
          "Rafael Nadal",
          "Novak Djokovic",
          "Roger Federer"
    };

    String[] c_names = {
            "安迪·穆雷",
            "拉菲尔·纳达尔",
            "诺瓦克·德约科维奇",
            "罗杰·费德勒"
    };

    int[] ao_wang = {
            0,
            1,
            8,
            6
    };

    int[] fa_wang = {
            0,
            12,
            6,
            1
    };

    int[] wen_wang = {
            2,
            2,
            5,
            8
    };

    int[] mei_wang = {
            1,
            4,
            3,
            5
    };

    String[] content = {
        "3岁的时候，安迪·穆雷开始打网球。2004年，赢得美国公开赛青少年组冠军。2005年，正式转入职业。2006年2月，在圣何塞拿到了个人第一个ATP巡回赛冠军。2008年，在美国网球公开赛第一次打入大满贯决赛。2009年8月17日，世界排名升到世界第二。\n" +
                "2012年，在伦敦奥运会男单决赛直落三盘战胜费德勒，成为104年以来英国第一位奥运会网球单打金牌得主；同年，在美国网球公开赛夺冠，成为1936年以来76年中第一位夺得大满贯男单冠军的英国选手。2013年，在温布尔登网球公开赛决赛以3:0力克德约科维奇，成为1936年来继弗雷德·佩里夺冠之后第一位拿下温网的英国本土选手。",
        "2001年纳达尔转入职业网坛；2005年7月世界排名攀升至第二；2008年8月首次登上世界第一。2010年纳达尔第五次夺得法网冠军。2013年10月他重返世界第一   。截至2019年9月，纳达尔共获得十九个大满贯冠军，包括十二次法网冠军，两次温网冠军，一次澳网冠军和四次美网冠军，并获得过北京奥运会单打冠军和里约奥运会男子双打冠军  。纳达尔是现役男运动员中三位全满贯得主之一，也是历史上男运动员中两位金满贯得主之一 。",
        "诺瓦克·德约科维奇（Novak Djokovic），1987年5月22日出生于塞尔维亚，塞尔维亚职业网球运动员。\n" +
                "2003年，德约科维奇转为职业球员，开始职业生涯。2007年，世界排名升至第三(现在世界排名第一)。2008年，首次获得澳网冠军。2011年，获得澳网、温网和美网冠军 ，世界排名升至第一。2016年，勇夺法网冠军，并实现跨年连夺四大满贯的壮举，完成职业生涯全满贯。2018年8月，首次问鼎辛辛那提大师赛，职业生涯包揽大师赛全部九站冠军，达成“金大师”伟业  。2020年2月2日德约科维奇逆转战胜蒂姆，成就史无前例的澳网八冠王，也将自己职业生涯大满贯数量增加至17个。",
        "罗杰·费德勒（Roger Federer），1981年8月8日出生于瑞士巴塞尔，瑞士男子职业网球运动员（1998年转为职业），以全面稳定的技术、华丽积极的球风、绅士优雅的形象而著称。众多评论家、现役与退役的选手认为费德勒为史上最伟大球员之一。费德勒不仅在网球领域取得成功，亦在慈善和商业领域活跃。"
    };

}
